In [2]:
import pandas as pd

In [3]:
employees = [
  {
    "id": 1,
    "first_name": "Jayne",
    "last_name": "Burchmore",
    "email": "jburchmore0@unicef.org",
    "gender": "Female",
    "yearly_salary": 78395,
    "years_of_experience": 23
  },
  {
    "id": 2,
    "first_name": "Anna",
    "last_name": "De Paoli",
    "email": "adepaoli1@t.co",
    "gender": "Female",
    "yearly_salary": 102972,
    "years_of_experience": 28
  },
  {
    "id": 3,
    "first_name": "Abbott",
    "last_name": "Itzchaki",
    "email": "aitzchaki2@bloglovin.com",
    "gender": "Male",
    "yearly_salary": 178876,
    "years_of_experience": 12
  },
]

In [4]:
df = pd.DataFrame(employees)
df

,id,first_name,last_name,email,gender,yearly_salary,years_of_experience
0,1,Jayne,Burchmore,jburchmore0@unicef.org,Female,78395,23
1,2,Anna,De Paoli,adepaoli1@t.co,Female,102972,28
2,3,Abbott,Itzchaki,aitzchaki2@bloglovin.com,Male,178876,12

In [6]:
employees_dict = {
    "id": [1, 2, 3],
    "first_name": ["Jayne", "Anna", "Abbott"],
    "last_name": ["Burchmore", "De Paoli", "Itzchaki"],
    "email": ["jburchmore0@unicef.org", "adepaoli1@t.co", "aitzchaki2@bloglovin.com"],
    "gender": ["Female", "Female", "Male"],
    "yearly_salary": [78395, 102972, 178876],
    "years_of_experience": [23, 28, 12]
}

In [7]:
df2 = pd.DataFrame(employees_dict)
df2

,id,first_name,last_name,email,gender,yearly_salary,years_of_experience
0,1,Jayne,Burchmore,jburchmore0@unicef.org,Female,78395,23
1,2,Anna,De Paoli,adepaoli1@t.co,Female,102972,28
2,3,Abbott,Itzchaki,aitzchaki2@bloglovin.com,Male,178876,12

In [8]:
employees_list = [
    [1, "Jayne", "Burchmore", "jburchmore0@unicef.org", "Female", 78395, 23],
    [2, "Anna", "De Paoli", "adepaoli1@t.co", "Female", 102972, 28],
    [3, "Abbott", "Itzchaki", "aitzchaki2@bloglovin.com", "Male", 178876, 12]
]

columns = ["id", "first_name", "last_name", "email", "gender", "yearly_salary", "years_of_experience"]

In [9]:
df3 = pd.DataFrame(employees_list, columns=columns)
df3

,id,first_name,last_name,email,gender,yearly_salary,years_of_experience
0,1,Jayne,Burchmore,jburchmore0@unicef.org,Female,78395,23
1,2,Anna,De Paoli,adepaoli1@t.co,Female,102972,28
2,3,Abbott,Itzchaki,aitzchaki2@bloglovin.com,Male,178876,12